# select from语句

## 查询单个时间序列的数据

查询导入的测试数据中的所有行数据：

```SQL
select WROT_HubTmp from root.BHSFC.Q1.W002
```

输出的结果如下（仅截取前6行数据）：

```SQL
IoTDB> select WROT_HubTmp from root.BHSFC.Q1.W002
+-----------------------------+------------------------------+
|                         Time|root.BHSFC.Q1.W002.WROT_HubTmp|
+-----------------------------+------------------------------+
|2022-01-11T21:51:40.000+08:00|                          14.4|
|2022-01-11T21:51:54.000+08:00|                          14.5|
|2022-01-11T21:52:01.000+08:00|                          14.4|
|2022-01-11T21:53:56.000+08:00|                          14.3|
|2022-01-11T21:54:14.000+08:00|                          14.4|-
|2022-01-11T21:56:17.000+08:00|                          14.3|
```

默认显示1000行，也可以限制显示的数目，在末尾加上“limit <数目>”即可,如只要显示10行，SQL语句为：

```SQL
select WROT_HubTmp from root.BHSFC.Q1.W002 limit 10
```

也可以限制起始行数，SQL语句为：

```SQL
select WROT_HubTmp from root.BHSFC.Q1.W002 limit 2 offset 2
```

这样查询的结果就会从第三行开始显示，且只显示两个数据：

```SQL
IoTDB> select WROT_HubTmp from root.BHSFC.Q1.W002 limit 2 offset 2
+-----------------------------+------------------------------+
|                         Time|root.BHSFC.Q1.W002.WROT_HubTmp|
+-----------------------------+------------------------------+
|2022-01-11T05:52:01.000+08:00|                          14.4|
|2022-01-11T05:53:56.000+08:00|                          14.3|
+-----------------------------+------------------------------+
Total line number = 2
```

查询的结果默认按时间由远到近排列，如果我们想要最新的时间显示在前面，则加上`ORDER BY TIME DESC`子句，例如查询最新的五条数据：

```SQL
select WROT_HubTmp from root.BHSFC.Q1.W002 order by time desc limit 5
```

输出的结果如下：

```SQL
IoTDB> select WROT_HubTmp from root.BHSFC.Q1.W002 order by time desc limit 5
+-----------------------------+------------------------------+
|                         Time|root.BHSFC.Q1.W002.WROT_HubTmp|
+-----------------------------+------------------------------+
|2022-01-15T06:46:40.000+08:00|                          16.0|
|2022-01-15T06:46:28.000+08:00|                          15.9|
|2022-01-15T06:46:02.000+08:00|                          16.0|
|2022-01-15T06:45:56.000+08:00|                          15.9|
|2022-01-15T06:45:50.000+08:00|                          16.0|
+-----------------------------+------------------------------+
Total line number = 5
```

查询我们用SQL语句写入的speed时间序列，SQL语句为：

```SQL
select speed from root.BHSFC.Q1.W003
```

输出的结果如下：

```SQL
IoTDB> select speed from root.BHSFC.Q1.W003
+-----------------------------+------------------------+
|                         Time|root.BHSFC.Q1.W003.speed|
+-----------------------------+------------------------+
|2022-07-11T00:00:00.000+08:00|                     1.0|
+-----------------------------+------------------------+
Total line number = 1
```

可以看到之前插入时输入的时间戳1657468800000自动转换成了时间2022年7月11日0点0分0秒。

## 查询多个时间序列的数据

如果要查询多个时间序列的数据，可以输入SQL 语句：

```SQL
`select * from root.BHSFC.** limit 10`
```

*是通配符，可以代替字符，模糊查询。*在路径中表示一层，**表示一层或多层。

输入上述SQL语句，就会显示root.BHSFC.Q1.W002.WROT_HubTmp和root.BHSFC.Q1.W003.speed两条时间序列的前十个值。

以上的查询结果默认按照时间戳大小升序排列，即日期从远到近。如果要使查询结果按日期从近到远，则可输入SQL语句：

```SQL
`select WROT_HubTmp from root.BHSFC.Q1.W002 order by time desc`
select status, temperature from root.ln.wf01.wt01
```

## 查询最新数据

如果要查询指定时间序列的最新数据，可以输入SQL语句：

```SQL
select last WROT_HubTmp from root.BHSFC.Q1.W002
```

查询结果为：

```SQL
IoTDB> select last WROT_HubTmp from root.BHSFC.Q1.W002
+-----------------------------+------------------------------+-----+--------+
|                         Time|                    timeseries|value|dataType|
+-----------------------------+------------------------------+-----+--------+
|2022-01-15T06:46:40.000+08:00|root.BHSFC.Q1.W002.WROT_HubTmp| 16.0|  DOUBLE|
+-----------------------------+------------------------------+-----+--------+
Total line number = 1
```

也可以查询多个时间序列的最新值。

```SQL
select last * from root.BHSFC.**
```

查询结果为：

```SQL
IoTDB> select last * from root.BHSFC.**
+-----------------------------+------------------------------+-----+--------+
|                         Time|                    timeseries|value|dataType|
+-----------------------------+------------------------------+-----+--------+
|2022-01-15T06:46:40.000+08:00|root.BHSFC.Q1.W002.WROT_HubTmp| 16.0|  DOUBLE|
|2022-07-11T00:00:00.000+08:00|      root.BHSFC.Q1.W003.speed|  1.0|   FLOAT|
+-----------------------------+------------------------------+-----+--------+
Total line number = 2
```

# where语句

## 时间过滤

我们可以查询某个时间段的数据，例如查询测试数据中2022年1月12日之前的数据，输入的SQL语句为：

```SQL
select WROT_HubTmp from root.BHSFC.Q1.W002 where time <2022-01-12
```

输出的结果如下（仅截取前3行数据）：

```SQL
IoTDB> select WROT_HubTmp from root.BHSFC.Q1.W002 where time <2022-01-12
+-----------------------------+------------------------------+
|                         Time|root.BHSFC.Q1.W002.WROT_HubTmp|
+-----------------------------+------------------------------+
|2022-01-11T21:51:40.000+08:00|                          14.4|
|2022-01-11T21:51:54.000+08:00|                          14.5|
|2022-01-11T21:52:01.000+08:00|                          14.4|
```

也查询某个时刻之前的数据，例如查询测试数据中2022年1月22日5点之前的数据，输入的SQL语句为：

```SQL
select WROT_HubTmp from root.BHSFC.Q1.W002 where time <2022-01-12T05:00:00
```

输出的结果如下（仅截取前3行数据）：

```SQL
IoTDB> select WROT_HubTmp from root.BHSFC.Q1.W002 where time <2022-01-12T05:00:00
+-----------------------------+------------------------------+
|                         Time|root.BHSFC.Q1.W002.WROT_HubTmp|
+-----------------------------+------------------------------+
|2022-01-11T21:51:40.000+08:00|                          14.4|
|2022-01-11T21:51:54.000+08:00|                          14.5|
|2022-01-11T21:52:01.000+08:00|                          14.4|
```

## 查询时间范围内的最新数据

我们可以查询时间序列的最新数据，如查询时间序列root.BHSFC.Q1.W002.WROT_HubTmp的最新点为：

```SQL
select last WROT_HubTmp from root.BHSFC.Q1.W002
```

查询结果为：

```SQL
IoTDB> select last WROT_HubTmp from root.BHSFC.Q1.W002
+-----------------------------+------------------------------+-----+--------+
|                         Time|                    timeseries|value|dataType|
+-----------------------------+------------------------------+-----+--------+
|2022-01-15T06:46:40.000+08:00|root.BHSFC.Q1.W002.WROT_HubTmp| 16.0|  DOUBLE|
+-----------------------------+------------------------------+-----+--------+
Total line number = 1
```

也可以查询某个时间前后的最新数据，如查询2022年1月14日零点之前的最新值，SQL语句为：

```SQL
select last WROT_HubTmp from root.BHSFC.Q1.W002  where time >= 2022-1-14T00:00:00
```

## 值过滤

我们也可以查询值满足某些条件的数据，例如查询测试数据中值大于20的数据，输入的SQL语句为：

```SQL
select WROT_HubTmp from root.BHSFC.Q1.W002 where WROT_HubTmp > 20
```

输出的结果如下（仅截取前3行数据）：

```SQL
IoTDB> select WROT_HubTmp from root.BHSFC.Q1.W002 where WROT_HubTmp > 20
+-----------------------------+------------------------------+
|                         Time|root.BHSFC.Q1.W002.WROT_HubTmp|
+-----------------------------+------------------------------+
|2022-01-13T04:14:42.000+08:00|                          20.1|
|2022-01-13T04:19:52.000+08:00|                          20.1|
|2022-01-13T04:43:09.000+08:00|                          20.1|
```

 查询值的区间为[21,24)，SQL语句为：

```SQL
select WROT_HubTmp from root.BHSFC.Q1.W002 where WROT_HubTmp >= 21 and WROT_HubTmp < 24 
```

输出的结果如下（仅截取前3行数据）：

```SQL
IoTDB> select WROT_HubTmp from root.BHSFC.Q1.W002 where WROT_HubTmp >= 21 and WROT_HubTmp < 24
+-----------------------------+------------------------------+
|                         Time|root.BHSFC.Q1.W002.WROT_HubTmp|
+-----------------------------+------------------------------+
|2022-01-12T15:03:50.000+08:00|                          21.0|
|2022-01-12T15:39:21.000+08:00|                          21.0|
|2022-01-12T15:39:36.000+08:00|                          21.1|
```